Repository: izyuumi/yorozu
Catalog: apps/mac/Resources/InfoPlist.xcstrings
Source language: en
Languages: ja

# NSAppleEventsUsageDescription
source: Yorozu drives Finder, Safari, Mail, Calendar, Messages and other apps on your behalf.
ja: Yorozuが依頼に応じてFinder、Safari、メール、カレンダー、メッセージなどのアプリを操作します。

# NSCalendarsUsageDescription
source: Yorozu reads and writes your calendar when you ask it to.
ja: Yorozuが依頼に応じてカレンダーを読み書きします。

# NSCalendarsFullAccessUsageDescription
source: Yorozu reads and writes your calendar when you ask it to.
ja: Yorozuが依頼に応じてカレンダーを読み書きします。

# NSRemindersUsageDescription
source: Yorozu reads and writes your reminders when you ask it to.
ja: Yorozuが依頼に応じてリマインダーを読み書きします。

# NSRemindersFullAccessUsageDescription
source: Yorozu reads and writes your reminders when you ask it to.
ja: Yorozuが依頼に応じてリマインダーを読み書きします。

# NSContactsUsageDescription
source: Yorozu looks up the people you write to, so you can say a name instead of an address.
ja: Yorozuが送信先の連絡先を検索し、アドレスの代わりに名前で指定できるようにします。

# NSPhotoLibraryUsageDescription
source: Yorozu finds and attaches pictures from your library when you ask it to.
ja: Yorozuが依頼に応じてライブラリから写真を検索し、添付します。

# NSPhotoLibraryAddUsageDescription
source: Yorozu saves pictures to your library when you ask it to.
ja: Yorozuが依頼に応じて写真をライブラリに保存します。

# NSAppleMusicUsageDescription
source: Yorozu reads your music library so it can play what you ask for.
ja: Yorozuがミュージックライブラリを読み取り、指定された曲を再生します。

# NSLocationUsageDescription
source: Yorozu uses where you are to answer questions about travel time, weather and what is nearby.
ja: Yorozuが位置情報を使い、移動時間、天気、周辺情報についての質問に答えます。

# NSLocationWhenInUseUsageDescription
source: Yorozu uses where you are to answer questions about travel time, weather and what is nearby.
ja: Yorozuが位置情報を使い、移動時間、天気、周辺情報についての質問に答えます。

# NSCameraUsageDescription
source: Yorozu takes a picture only when you ask it to.
ja: Yorozuが依頼された場合だけ写真を撮影します。

# NSMicrophoneUsageDescription
source: Yorozu listens only when you ask it to.
ja: Yorozuが依頼された場合だけ音声を聞き取ります。

# NSSpeechRecognitionUsageDescription
source: Yorozu turns what you dictate into the message you send.
ja: Yorozuが音声入力を、送信するメッセージの文章に変換します。

# NSDesktopFolderUsageDescription
source: Yorozu reads and writes files on your Desktop when you ask it to.
ja: Yorozuが依頼に応じてデスクトップのファイルを読み書きします。

# NSDocumentsFolderUsageDescription
source: Yorozu reads and writes files in your Documents folder when you ask it to.
ja: Yorozuが依頼に応じて書類フォルダのファイルを読み書きします。

# NSDownloadsFolderUsageDescription
source: Yorozu reads and writes files in your Downloads folder when you ask it to.
ja: Yorozuが依頼に応じてダウンロードフォルダのファイルを読み書きします。

# NSNetworkVolumesUsageDescription
source: Yorozu reads and writes files on network volumes when you ask it to.
ja: Yorozuが依頼に応じてネットワークボリュームのファイルを読み書きします。

# NSRemovableVolumesUsageDescription
source: Yorozu reads and writes files on external drives when you ask it to.
ja: Yorozuが依頼に応じて外部ドライブのファイルを読み書きします。

# NSFileProviderDomainUsageDescription
source: Yorozu reads and writes files in iCloud Drive, Proton Drive and your other cloud drives when you ask it to.
ja: Yorozuが依頼に応じてiCloud Drive、Proton Driveなどのクラウドドライブのファイルを読み書きします。

# NSSystemAdministrationUsageDescription
source: Yorozu needs Full Disk Access to read and write files anywhere you can.
ja: Yorozuがユーザーのアクセス可能な場所のファイルを読み書きするには、フルディスクアクセスが必要です。
